annoyedmilk/esp32-s31-linux/bootloader/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
CONFIG_FREERTOS_UNICORE=y
CONFIG_ESP_SYSTEM_SINGLE_CORE_MODE=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_320=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_BOOT_HW_INIT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MEMMAP=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# NVS is disabled here, so PHY calibration cannot be cached: ask for a full
# calibration outright instead of failing the NVS lookup on every boot.
# CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE is not set
# GPIO33/34 are both the LCD data bus and the native USB Serial/JTAG D-/D+,
# and the loader skips display init when a secondary console claims them.
# Select CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG for JTAG and a dark
# panel; flashing and the Linux console use the CP2102N bridge either way.
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
